## Terraform data for `cluster` stack
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Show Validation</summary>

```
Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
module.cert_manager.null_resource.cert_manager_ovh_source: Refreshing state... [id=6901452211892208863]
module.cert_manager.helm_release.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_cluster_role.promtail: Refreshing state... [id=promtail]
module.monitoring_routing.kubectl_manifest.virtual_services["app-s42-dashboards"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/monitoring/virtualservices/app-s42-dashboards]
kubernetes_cluster_role.prometheus: Refreshing state... [id=prometheus]
kubernetes_role.loki: Refreshing state... [id=monitoring/loki]
kubernetes_service_account.tempo: Refreshing state... [id=monitoring/tempo]
module.loki.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/loki-config]
kubernetes_service_account.loki: Refreshing state... [id=monitoring/loki]
kubernetes_service_account.promtail: Refreshing state... [id=monitoring/promtail]
module.istio.kubectl_manifest.gateways["dev-s42-previews"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/previews/gateways/dev-s42-previews]
module.istio.kubectl_manifest.gateways["app-s42"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/production/gateways/app-s42]
module.istio.kubectl_manifest.gateways["app-s42-dashboards"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/monitoring/gateways/app-s42-dashboards]
module.istio.kubectl_manifest.gateways["app-s42-next"]: Refreshing state... [id=/apis/networking.istio.io/v1alpha3/namespaces/staging/gateways/app-s42-next]
module.grafana.kubernetes_deployment.app[0]: Refreshing state... [id=monitoring/grafana]
module.tempo.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/tempo-config]
module.grafana.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/grafana-data]
module.loki.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/loki-data]
module.prometheus.kubernetes_service.app[0]: Refreshing state... [id=monitoring/prometheus]
module.prometheus.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/prometheus-data]
module.promtail.kubernetes_daemonset.app[0]: Refreshing state... [id=monitoring/promtail]
module.prometheus.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/prometheus-config]
module.promtail.kubernetes_config_map.app["config"]: Refreshing state... [id=monitoring/promtail-config]
module.tempo.kubernetes_service.app[0]: Refreshing state... [id=monitoring/tempo]
module.tempo.kubernetes_persistent_volume_claim.app["data"]: Refreshing state... [id=monitoring/tempo-data]
module.grafana.kubernetes_service.app[0]: Refreshing state... [id=monitoring/grafana]
module.loki.kubernetes_service.app[0]: Refreshing state... [id=monitoring/loki]
module.promtail.kubernetes_service.app[0]: Refreshing state... [id=monitoring/promtail]
kubernetes_service_account.prometheus: Refreshing state... [id=monitoring/prometheus]
kubernetes_role_binding.loki: Refreshing state... [id=monitoring/loki]
kubernetes_cluster_role_binding.promtail: Refreshing state... [id=promtail]
module.prometheus.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/prometheus]
module.tempo.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/tempo]
module.cert_manager.kubernetes_role.cert_manager_webhook_ovh_secret_reader: Refreshing state... [id=cert-manager/cert-manager-webhook-ovh:secret-reader]
module.cert_manager.kubectl_manifest.certificates["dev-s42-sandbox"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/dev-s42-sandbox]
module.cert_manager.kubectl_manifest.certificates["app-s42"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42]
module.cert_manager.kubectl_manifest.certificates["app-s42-dashboards"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42-dashboards]
module.cert_manager.kubectl_manifest.certificates["app-s42-next"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/app-s42-next]
module.cert_manager.kubectl_manifest.certificates["dev-s42-previews"]: Refreshing state... [id=/apis/cert-manager.io/v1/namespaces/istio-system/certificates/dev-s42-previews]
module.loki.kubernetes_stateful_set.app[0]: Refreshing state... [id=monitoring/loki]
kubernetes_cluster_role_binding.prometheus: Refreshing state... [id=prometheus]
module.cert_manager.kubernetes_role_binding.cert_manager_webhook_ovh_secret_reader: Refreshing state... [id=cert-manager/cert-manager-webhook-ovh:secret-reader]
module.cert_manager.helm_release.cert_manager_ovh: Refreshing state... [id=cert-manager-webhook-ovh]
module.cert_manager.kubectl_manifest.issuers["ovh-staging-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ovh-staging-issuer]
module.cert_manager.kubectl_manifest.issuers["ovh-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ovh-issuer]
module.cert_manager.kubectl_manifest.self_signed_issuers["selfsigned-issuer"]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/selfsigned-issuer]
module.secrets.kubernetes_manifest.sealed_secret["ovh-credentials"]: Refreshing state...
module.secrets.kubernetes_manifest.sealed_secret["ghcr-creds"]: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.istio.kubectl_manifest.gateways["app-s42-next"] will be created
  + resource "kubectl_manifest" "gateways" {
      + api_version             = "networking.istio.io/v1alpha3"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Gateway"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "app-s42-next"
      + namespace               = "staging"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.istio.io/v1alpha3
            kind: Gateway
            metadata:
              name: app-s42-next
              namespace: staging
            spec:
              selector:
                istio: ingressgateway
              servers:
              - hosts:
                - next.s42.app
                port:
                  name: https
                  number: 443
                  protocol: HTTPS
                tls:
                  credentialName: app-s42-next-tls
                  mode: SIMPLE
              - hosts:
                - next.s42.app
                port:
                  name: http
                  number: 80
                  protocol: HTTP
                tls:
                  httpsRedirect: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.prometheus,
  on monitoring.tf line 73, in resource "kubernetes_service_account" "prometheus":
  73: resource "kubernetes_service_account" "prometheus" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: cluster-tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "cluster-tfplan"

```
</details>